<div style="text-align:center">
    <img src="imgs/cafe.png" alt="alt text" title="MSDS CAFE" width="500"/>
</div>

In [61]:
# Import libraries
import pandas as pd
from sqlalchemy import create_engine, text
from IPython.display import display

In [62]:
# Global vars
engine = create_engine('sqlite:///:memory:')

Things to note about the data:
- Menu has a new item that hasn't been sold yet
- Sales has a new item sold that isn't in the menu table yet

In [63]:
# Create the tables
files_and_tables = {
    'data/menu.csv': 'menu_table',
    'data/sales.csv': 'sales_table',
    'data/employees.csv': 'employees_table'
}

for filepath, tablename in files_and_tables.items():
    df = pd.read_csv(filepath)
    df.to_sql(tablename, engine, index=False)

# Fn to display results from query
def query_to_result(query):
    wrapped_query = text(query)
    result = pd.read_sql_query(wrapped_query, engine)
    display(result)

## TABLES

![alt text](imgs/ER_plot.png "ER diagram")

In [64]:
query = \
'SELECT * FROM menu_table'
query_to_result(query)

   item_id              item_name  price
0        1  Linear Regresso Latte    3.0
1        2              Croissant    2.5
2        3               Smoothie    4.0
3        4                   None    2.0
4        5       Outlier Omelette    3.5

In [65]:
query = \
'SELECT * FROM sales_table'
query_to_result(query)

   sale_id  item_id   sale_date
0        1        1  2023-10-01
1        2        2  2023-10-01
2        3        3  2023-10-02
3        4        1  2023-10-03
4        5        4  2023-10-04
5        6        6  2023-10-05

In [66]:
query = \
'SELECT * FROM employees_table'
query_to_result(query)

   employee_id employee_name  manager_id
0            1       Jiaxuan         5.0
1            2         Ireri         5.0
2            3       Rithvik         5.0
3            4        Bassim         5.0
4            5        Robert         NaN

## RELATIONAL JOINS

### INNER JOIN

In [67]:
query = \
'''
SELECT m.item_name, s.sale_date
FROM sales_table s
INNER JOIN menu_table m ON s.item_id = m.item_id;
'''
query_to_result(query)

               item_name   sale_date
0  Linear Regresso Latte  2023-10-01
1              Croissant  2023-10-01
2               Smoothie  2023-10-02
3  Linear Regresso Latte  2023-10-03
4                   None  2023-10-04

### LEFT JOIN

In [68]:
query = \
'''
SELECT m.item_name, s.sale_date
FROM menu_table m
LEFT JOIN sales_table s ON m.item_id = s.item_id;
'''
query_to_result(query)

               item_name   sale_date
0  Linear Regresso Latte  2023-10-01
1  Linear Regresso Latte  2023-10-03
2              Croissant  2023-10-01
3               Smoothie  2023-10-02
4                   None  2023-10-04
5       Outlier Omelette        None

### RIGHT JOIN

In [69]:
query = \
'''
SELECT m.item_name, s.sale_date
FROM menu_table m
RIGHT JOIN sales_table s ON m.item_id = s.item_id;
'''
query_to_result(query)

               item_name   sale_date
0  Linear Regresso Latte  2023-10-01
1  Linear Regresso Latte  2023-10-03
2              Croissant  2023-10-01
3               Smoothie  2023-10-02
4                   None  2023-10-04
5                   None  2023-10-05

### OUTER JOIN

In [70]:
query = \
'''
SELECT m.item_name, s.sale_date
FROM menu_table m
FULL OUTER JOIN sales_table s ON m.item_id = s.item_id;
'''
query_to_result(query)

               item_name   sale_date
0  Linear Regresso Latte  2023-10-01
1  Linear Regresso Latte  2023-10-03
2              Croissant  2023-10-01
3               Smoothie  2023-10-02
4                   None  2023-10-04
5       Outlier Omelette        None
6                   None  2023-10-05

### CROSS JOIN

In [71]:
query = \
'''
SELECT m.item_name, s.sale_date
FROM menu_table m
CROSS JOIN sales_table s;
'''
query_to_result(query)

                item_name   sale_date
0   Linear Regresso Latte  2023-10-01
1   Linear Regresso Latte  2023-10-01
2   Linear Regresso Latte  2023-10-02
3   Linear Regresso Latte  2023-10-03
4   Linear Regresso Latte  2023-10-04
5   Linear Regresso Latte  2023-10-05
6               Croissant  2023-10-01
7               Croissant  2023-10-01
8               Croissant  2023-10-02
9               Croissant  2023-10-03
10              Croissant  2023-10-04
11              Croissant  2023-10-05
12               Smoothie  2023-10-01
13               Smoothie  2023-10-01
14               Smoothie  2023-10-02
15               Smoothie  2023-10-03
16               Smoothie  2023-10-04
17               Smoothie  2023-10-05
18                   None  2023-10-01
19                   None  2023-10-01
20                   None  2023-10-02
21                   None  2023-10-03
22                   None  2023-10-04
23                   None  2023-10-05
24       Outlier Omelette  2023-10-01
25       Outlier Omelette  2023-10-01
26       Outlier Omelette  2023-10-02
27       Outlier Omelette  2023-10-03
28       Outlier Omelette  2023-10-04
29       Outlier Omelette  2023-10-05

### SELF JOIN

In [72]:
query = \
'''
SELECT e1.employee_name, e2.employee_name AS manager_name
FROM employees_table e1
LEFT JOIN employees_table e2 ON e1.manager_id = e2.employee_id;
'''
query_to_result(query)

  employee_name manager_name
0       Jiaxuan       Robert
1         Ireri       Robert
2       Rithvik       Robert
3        Bassim       Robert
4        Robert         None